import numpy as np
a = np.array([1,2,3,4,5])
b = np.array([[1,2,3,4,5],
              [6,7,8,9,10],
              [2,4,6,8,9]])

#普通索引
print(a[0])
print(b[0,1])#b[行,列]
print(b[0][1])

#切片
#一维切片
print(a[:3])
#二维切片
print(b[:2,1])#b[行切片，列切片]
print(b[0,:])#取第0行
print(b[:,0])#取第0列

#布尔索引（按条件筛选）
print(a[a>3])
print(a[(a>1)&(a<4)])
print(b[b>3])

#花式索引(一次性选中多行、多列)
#一维a[[多个位置索引]]
print(a[[0,2,4]])#取第 0、2、4 个元素
#二维b[[行索引]，[列索引]]
print(b[[0,2]])#取第0、2行
print(b[:,[0,2,4]])#取第0、2、4列
print(b[[0,2],[2,4]])#会一一对应取点
print(b[ [0, 2] ][:, [0, 2, 4] ])#第 0、2 行 + 第 0、2、4 列
